<?php

/* @var $this yii\web\View */

$this->title = 'R&B Afla Group';
?>
<div class="site-index">

    <div class="body-content">
        R&B Afla Group</br>
        Тестовое задание №2</br></br>
        WEB-программист (PHP)</br>
        Задание - Создание справочника</br>
        Создать справочник журналов, с возможностью CRUD. (Можно использовать любой Framework или голый php)</br>
        1. У каждого журнала должны быть:</br>
        Название. (Обязательное поле)</br>
        Короткое описание. (Необязательное поле)</br>
        Картинка. (jpg или png, не больше 2 Мб, должна сохраняться в отдельную папку и иметь уникальное имя файла)</br>
        Авторы (Обязательное поле, может быть несколько авторов у одного журнала, должна быть возможность выбирать из списка авторов, который создается отдельно).</br>
        Дата выпуска журнала.</br>
        2. Список авторов создается отдельно. Также должна быть возможность добавления, удаления и редактирования. У каждого автора должны быть:</br>
        Фамилия (Обязательное поле, не короче 3 символов)</br>
        Имя (Обязательное, не пустое)</br>
        Отчество (Необязательное)</br>
        3. На выходе получаем:</br>
        Просмотр отдельно страниц журналов и авторов. На странице авторов:</br>
        Должна быть возможность увидеть список всех журналов определенного автора.</br>
        Сделать сортировку авторов по фамилии</br>
        После прочтения, отправить письмо на E-mail: fabien244244@gmail.com c ориентировочным временем выполнения.</br>
        P.S. Все исходники направить на E-mail: fabien244244@gmail.com</br>
    </div>
</div>
